{"id":3763,"date":"2023-10-30T11:19:11","date_gmt":"2023-10-30T11:19:11","guid":{"rendered":"https:\/\/dryice.co.za\/?p=3763"},"modified":"2024-05-22T08:07:54","modified_gmt":"2024-05-22T08:07:54","slug":"your-guide-to-the-wonders-of-dry-ice","status":"publish","type":"post","link":"https:\/\/dryice.co.za\/your-guide-to-the-wonders-of-dry-ice\/","title":{"rendered":"Your guide to the wonders of dry ice"},"content":{"rendered":"<p><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter wp-image-3764 size-full\" src=\"https:\/\/dryice.co.za\/wp-content\/uploads\/2023\/10\/dryicearticel.webp\" alt=\"\" width=\"1165\" height=\"334\" srcset=\"https:\/\/dryice.co.za\/wp-content\/uploads\/2023\/10\/dryicearticel.webp 1165w, https:\/\/dryice.co.za\/wp-content\/uploads\/2023\/10\/dryicearticel-300x86.webp 300w, https:\/\/dryice.co.za\/wp-content\/uploads\/2023\/10\/dryicearticel-1024x294.webp 1024w, https:\/\/dryice.co.za\/wp-content\/uploads\/2023\/10\/dryicearticel-768x220.webp 768w\" sizes=\"(max-width: 1165px) 100vw, 1165px\" \/><\/p>\n<p>For years, the zing cold product known as dry ice has been a saving grace for industries with perishables and science fans alike. As much as it is a useful product, it has been popularised by numerous ‘scientific experiments’ on YouTube.  Dry ice is used across all sorts of industries and continues to be exceptionally useful. Not much about dry ice has changed since its first discovery, but what has changed is the number of benefits and uses that we continue to discover.<\/p>\n<p><em><strong>Did you know that dry ice resembles water ice or snow, although it is not made with a liquid?<\/strong><\/em><\/p>\n<p>And that is because dry ice is the frozen form of carbon dioxide, and it is exceptionally cold. In fact, dry ice is so cold that it is able to cause severe frost-bite-like burns, which is exactly why it should never be touched with the naked hand. But what separates dry ice from normal ice is that when it breaks down, it doesn’t turn into a liquid – rather, it returns to a gas form and evaporates, while it also has a unique appearance. You can tell the difference between dry ice and water-based ice by looking at it: frozen CO<sub>2<\/sub> gives off a characteristic mist as it evaporates.<\/p>\n<p>But CO<sub>2<\/sub> is not the only gas that takes on exceptional frozen quality. The other gas that can be used to keep things cool is liquid nitrogen, although trying to handle liquid nitrogen makes the task of keeping things cold almost impossible. It’s messy and can be dangerous. Dry ice is the simplest and easiest way to keep things cold.<\/p>\n<p>The history of dry ice goes back to 1835 when the records of a French inventor make the first mention of dry ice. But the discovery of dry ice was never patented. The first successful commercial endeavour with dry ice belongs to an American, Thomas B. Slate, and the substance received its name from the company that first sold it.<\/p>\n<p>Dry ice is readily available throughout South Africa, allowing you to buy it in all major cities.<\/p>\n<h2><strong>Wondering about the benefits of dry ice?<\/strong><\/h2>\n<p>Frozen CO<sub>2<\/sub> comes with numerous benefits, but there are certain reasons why dry ice remains so popular:<\/p>\n<ol>\n<li><em>You can use it around electrical appliances<\/em><\/li>\n<\/ol>\n<p>Fantastic for use in factories, dry ice doesn’t create a hazardous environment when it is used around appliances or plug sockets. Instead of the ice-breaking down into a liquid which can cause danger, the ice turns into a gas and evaporates.<\/p>\n<ol start=\"2\">\n<li><em>It’s a great preserving agent<\/em><\/li>\n<\/ol>\n<p>And this is not only for keeping perishables nice and fresh. While one of the primary purposes of dry ice is to keep food cold when it is being transported, it can also be used when you want to preserve other things such as medicine. Not only does it keep medicine preserved, but dry ice can also be used for preserving bacteria and medical samples.<\/p>\n<ol start=\"3\">\n<li><em>You are helping to keep the environment safe<\/em><\/li>\n<\/ol>\n<p>When using dry ice, you are using an environmentally safe material. It is also a non-toxic product so it will not contaminate whatever it is keeping cold.<\/p>\n<ol start=\"4\">\n<li><em>It’s versatile<\/em><\/li>\n<\/ol>\n<p>Because dry ice comes in a variety of shapes and sizes, it’s a wonderfully versatile product to use. You will never have to worry about finding the right size dry ice for your needs.<\/p>\n<p><strong>Dry ice doesn’t float. When put in water it will sink because it is far denser than the water surrounding it.<\/strong><\/p>\n<h2><strong>More than just for preservation<\/strong><\/h2>\n<p>Recently, a series of photographs made waves online: it shows a Porsche being given a clean with a <strong>dry ice blasting<\/strong> machine. Usually, such machines are only used when cleaning outdoor surfaces or tough machinery, so not many would think to use it on their prized Porsche. But the photo series does show us one of the biggest reasons dry ice blasting should be more popular than it is: the cleaning method is so incredibly gentle that it removes all traces of grime and dirt, both in the engine and on the exterior, in a few swift motions.<\/p>\n<p>Dry ice blasting is one of the most common uses of the product, and it can be used in almost any environment and on almost any machine or surface. This method of cleaning is similar to sandblasting but without the worry that it’s going to chip or damage what is being cleaned in any way. This is also a mess- way to clean, as instead of having to worry about cleaning up a liquid mess, the CO<sub>2<\/sub> will evaporate completely.<\/p>\n<p><strong>Dry ice is even found on the surface of Mars – it appears naturally at the planet’s very cold north and south poles.<\/strong><\/p>\n<p>Apart from dry ice blasting, you can also <strong>use dry ice for artistic purposes,<\/strong> with many stage productions and photographers using dry ice to provide an aesthetic appeal to their artistic ventures.<\/p>\n<p>This product can also play a role in <strong>removing the dents from your car<\/strong>, those caused by hail or which are the result of small bumps. The ice causes the metal to condense when it is placed on the inside of the dent. It is best to rather let a professional do this, but it is an interesting method that you can consider the next time you have a dent in the bodywork of your car.<\/p>\n<p>And if you are looking for a way to <strong>remove a floor tile<\/strong> without damaging it, place dry ice onto it. The frozen carbon dioxide will cause the tile to shrink slightly and break the cement bond that is keeping the tile secure on the floor.<\/p>\n<p>Anyone can benefit from the numerous wonders and uses of dry ice. As a safe-to-use, non-toxic option, it is a wonderful product. At Dry Ice International, we sell affordable dry ice in all sizes for all kinds of applications.<\/p>\n<h6><a href=\"https:\/\/dryice.co.za\/contact-us\/\">Contact us<\/a> today for quality dry ice that you can trust to do the job.<\/h6>\n","protected":false},"excerpt":{"rendered":"<p>For years, the zing cold product known as dry ice has been a saving grace for industries with perishables and science fans alike. As much as it is a useful product, it has been popularised by numerous ‘scientific experiments’ on YouTube.  Dry ice is used across all sorts of industries and continues to be exceptionally [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3764,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[128],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3763"}],"collection":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/comments?post=3763"}],"version-history":[{"count":1,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3763\/revisions"}],"predecessor-version":[{"id":5643,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3763\/revisions\/5643"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/media\/3764"}],"wp:attachment":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/media?parent=3763"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/categories?post=3763"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/tags?post=3763"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}