{"id":3789,"date":"2023-10-30T11:40:54","date_gmt":"2023-10-30T11:40:54","guid":{"rendered":"https:\/\/dryice.co.za\/?p=3789"},"modified":"2024-05-22T08:07:31","modified_gmt":"2024-05-22T08:07:31","slug":"planning-your-easter-fishing-trip","status":"publish","type":"post","link":"https:\/\/dryice.co.za\/planning-your-easter-fishing-trip\/","title":{"rendered":"Planning your Easter Fishing Trip"},"content":{"rendered":"<p>It’s well known that pickled fish and Easter in the Cape go hand in hand. That said, fishing in any part of the country is popular over the Easter weekend and pickling is a good way to preserve fish, if you enjoy anything that’s been pickled.<\/p>\n<p>As a pastime, fishing is one of the best ways to destress and unwind. That’s if you have everything well prepared, of course – including how you’re going to keep the bait fresh and preserve your catch if you’re intending to bring it home with you.<\/p>\n<p>The traditional way to keep your bait and fish from going off is to keep it cool with ice. One of the downsides of that is that, on a hot day, ice can quickly turn to water, which becomes unhygienic when mixed with dirt or old bait as it slops around an ice box.<\/p>\n<p>This is one of the main reasons why professional fishermen choose to use dry ice.<\/p>\n<p>Dry ice is safe, affordable, long-lasting and ideal for fishing both out on the open sea and on the banks of a dam or river. In fact, dry ice has multiple uses – keeping bait cool and fresh, keeping the beverages crisp and cool, and preserving the fish that you catch while you tackle the waves or potholes on your way home.<\/p>\n<p><b>WHY USE DRY ICE?<\/b><\/p>\n<p>Dry ice is frozen carbon dioxide (CO₂) that will remain in the frozen state for as long as the temperature is maintained at -79°C. It is seven times more effective than ice made from water when it comes to cooling, and it doesn’t leave any liquid or solid residue after it has melted – it simply evaporates. Most importantly, when kept at the optimum temperature, it can keep fish frozen for periods of four days and longer without electricity.<\/p>\n<p>If you’re going to be away for long periods, like a 4- or 5-day long weekend, dry ice is definitely the preferred choice when it comes to keeping food and drinks cold. There’s no need for a bulky freezer reliant on a generator or electricity stored in batteries.<\/p>\n<p><b>SOME SAFETY TIPS<\/b><\/p>\n<p>Dry ice is a non-toxic, non-flammable food-grade product, which transforms from a solid directly to a gas. It’s the transformation that creates the cooling effect and, if managed correctly while wearing protective gloves, it is safe to use and easy to handle.<\/p>\n<p>When keeping bait cool, it’s best to place the dry ice under the bait. However, for keeping fish frozen, place the dry ice above it.<\/p>\n<p>Because dry ice expands as it transforms from a solid to a gas, it’s important to remember that you shouldn’t place the dry ice in an airtight container or in a freezer. Rather use an insulated cooler box or a polystyrene container and, to extend its lifespan, cover the container with a blanket.<\/p>\n<p><b>HOW DO I PURCHASE DRY ICE<\/b><\/p>\n<p>Dry Ice International has made it easy for you to buy supplies of dry ice in round and square blocks, as well as in the form of pellets in 3mm and 16mm sizes.<\/p>\n<p>For a 5-day long weekend, it’s advisable to purchase 6kg of dry ice for a 25 litre cooler box, 10kg for a 40 litre cooler box and 15kg for a 60 litre cooler box.<\/p>\n<p>We have retailers nationwide so you can get your dry ice when you need it. Simply, click here to find a store near you.<\/p>\n<p>There’s a reason that fishing is one of the most popular recreational activities in the world. There’s no doubt that fishing is a very healthy pastime, and keeping your stress levels down by relying on the convenience and ease of using dry ice will go a long way towards making this Easter weekend a memorable one. And, unless it’s one of your favourite treats, there won’t be any need to pickle your fish merely to preserve it!<\/p>\n<p>&nbsp;<br \/>\n<div class=\"_df_book df-lite\" id=\"df_3670\"  data-title=\"dry-ice-for-4-fishing\" _slug=\"dry-ice-for-4-fishing\" wpoptions=\"true\" thumbtype=\"\" ><\/div><script class=\"df-shortcode-script\" type=\"application\/javascript\">window.option_df_3670 = {\"outline\":[],\"autoEnableOutline\":\"false\",\"autoEnableThumbnail\":\"false\",\"overwritePDFOutline\":\"false\",\"direction\":\"1\",\"pageSize\":\"0\",\"source\":\"http:\\\/\\\/dryice.co.za\\\/wp-content\\\/uploads\\\/2023\\\/10\\\/DRY-ICE-4-FISHING-E-Brochure.pdf\",\"wpOptions\":\"true\"}; if(window.DFLIP && window.DFLIP.parseBooks){window.DFLIP.parseBooks();}<\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s well known that pickled fish and Easter in the Cape go hand in hand. That said, fishing in any part of the country is popular over the Easter weekend and pickling is a good way to preserve fish, if you enjoy anything that’s been pickled. As a pastime, fishing is one of the best [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3241,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[128],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3789"}],"collection":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/comments?post=3789"}],"version-history":[{"count":1,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3789\/revisions"}],"predecessor-version":[{"id":5638,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/posts\/3789\/revisions\/5638"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/media\/3241"}],"wp:attachment":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/media?parent=3789"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/categories?post=3789"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/tags?post=3789"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}