{"id":5145,"date":"2024-01-30T07:30:36","date_gmt":"2024-01-30T07:30:36","guid":{"rendered":"https:\/\/dryice.co.za\/?page_id=5145"},"modified":"2024-02-21T09:59:14","modified_gmt":"2024-02-21T09:59:14","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/dryice.co.za\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"5145\" class=\"elementor elementor-5145\" data-elementor-post-type=\"page\">\n\t\t\t\t<div class=\"elementor-element elementor-element-ae45345 e-flex e-con-boxed e-con e-parent\" data-id=\"ae45345\" data-element_type=\"container\">\n\t\t\t\t\t<div class=\"e-con-inner\">\n\t\t\t\t<div class=\"elementor-element elementor-element-f9df964 elementor-widget elementor-widget-text-editor\" data-id=\"f9df964\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.21.0 - 26-05-2024 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#69727d;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#69727d;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<div class=\"section the_content has_content\"><div class=\"section_wrapper\"><div class=\"the_content_wrapper\"><h2>Privacy Policy<\/h2><p> <\/p><p><strong>1. Information regarding the data obtained by Dry Ice International, on social and website networks.<\/strong><\/p><p>Dry Ice International wishes to inform their users of our privacy policy regarding social and website personal data voluntarily provide when registering on our various social media and website platforms. Dry Ice International informs all users that their personal data will be treated in accordance with international data protection regulations as set out by the General Data Protection Regulation (“GDPR”). Dry Ice International official websites suppose that the user expressly accepts this privacy policy and gives their consent to the processing of personal data as provided therein.<\/p><p><strong>2. Data on underaged users<\/strong><\/p><p>Access and registration on this network are not allowed to minors under fourteen (14) years of age, and this also means that the access and use of children under fourteen (14 years) on any website of Dry Ice International is prohibited. If the user is disabled, Dry Ice International warns that parental consent and\/or assistance from the user or their legal representative for access and use of the official websites of Dry Ice International will be necessary. Dry Ice International is expressly exempt from any liability that may arise from their official websites and social media pages being used by minors. In each case the responsibility will be that of the legal representatives.<\/p><p><strong>3. Controller Identification<\/strong><\/p><p>The user is hereby informed that Dry Ice International with business headquarters at 259 Vonkprop Street, Samcor Park, Silverton, Pretoria, Gauteng, South Africa is responsible for files and for processing information through which personal data of the user is collected and stored as a result of the registration and use of the website and social networks on which Dry Ice International is present.<\/p><p><strong>4. Purposes for which the personal data, information <\/strong>and<strong> consent are intended<\/strong><\/p><p>Personal information provided voluntarily by the user to the Dry Ice International through their official website and social media platforms will be part of data processing, responsibility of Sry Ice International in order to provide information about Dry Ice International by Whatsapp, email, fax, SMS, MMS, social networks or any other electronic or physical means, present or future, which enables commercial communication, sending newsletters to users who subscribe and the exchange of information with other users and Dry Ice International.<br \/>From the moment that the user uses this official website or social platforms he\/she is providing his\/her , unequivocal, specific, informed and express consent to the processing of their personal data to the Dry Ice International for the proper provision of such services in accordance with the provisions of this policy.<br \/>The user is to use the official website and social media platforms of Dry Ice International on which the company is present, and in the case that the user does not agree to the processing of data for such purposes, he\/she shall refrain from using or providing his personal information. Through official websites and social media platforms of Dry Ice International, users can share text, photos, videos and other information and \/ or content which will be subject to both Dry Ice International’s Privacy Policy, Social Media Policy and the Rules and Conditions of the Platform being used.<\/p><p>Users may not post personal data, photos and other content, with out prior approval from Dry Ice International. Dry Ice International will take ownership of this content on approval thereof.<br \/>Dry Ice International is entitled to delete any social media account platforms it owns. It is entitled to delete any “post” on its social media account platforms unilaterally and without prior notice or authorization to any user, when the user infringes or violates any law or the rules set out in this policy or the platform standards.<\/p><p><strong>5. Identification of the communications Dry Ice International<\/strong> intends to carry out via our website and social media network platforms The user is informed that all information and content posted on the official website and social media platforms of Dry Ice International may be visible by the other users of the official website and social networking platform. Therefore, all information and user content published on the official account of Dry Ice International in any social network platfrom will be communicated to other users by the very nature of this service.<\/p><p><strong>6. Other third-party service providers<\/strong><\/p><p>Dry Ice International advises the user that this entity is only responsible for and ensures data confidentiality, security and processing under this policy with respect to the personal data that is provided by the user through the company’s official page on the social network platforms and does not take any responsibility for the treatment and subsequent use of personal data that could be carried out by a third party, companies that could access such data because of the provision of services or performance of its business, establish hyperlinks to third party social networks, nor for those responsible for hyperlinks which Dry Ice International refers users to its official page through ongoing advertising.<\/p><p><strong>7. Data Quality Dry Ice International<\/strong> advises the user that other than the existence of legally-constituted representation, users may not use another person’s identity and communicate that person’s personal data. This means that the user shall at all times keep in mind that he\/she can only provide relevant personal data concerning his\/her own identity and it must be adequate, relevant, current, accurate and true. In any case, the user must respect the privacy of others, whether or not they are users of this social network platforms or the official website of Dry Ice International.<\/p><p><strong>8. Rights of access, rectification, cancellation, and data opposition<\/strong><\/p><p>Dry Ice International informs the user that he\/she may exercise his\/her rights of access, rectification, cancellation and opposition in writing to Dry Ice International via email sm@dryice.co.za or via mail to the address: 259 Vonkprop Street, Samcor Park, Silverton, Pretoria, Gauteng, South Africa, or to the address as disclosed in the General Data Protection Registry. For this purpose, the user shall send written communication to Dry ice International indicating the request or exercising his rights, along with a copy of his ID or legally valid document as proof of identity, explicitly stating his username on the social network where the Dry Ice International company account resides in order to be correctly identified.<\/p><p><strong>9. Other information<\/strong><\/p><p>Dry Ice International may modify and\/or at any time replace this policy, supplement and\/or amend the currently published version. Therefore the user must periodically review them in order to remain informed of the latest version<\/p><\/div><\/div><\/div>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Privacy Policy   1. Information regarding the data obtained by Dry Ice International, on social and website networks. Dry Ice International wishes to inform their users of our privacy policy regarding social and website personal data voluntarily provide when registering on our various social media and website platforms. Dry Ice International informs all users that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/pages\/5145"}],"collection":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/comments?post=5145"}],"version-history":[{"count":0,"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/pages\/5145\/revisions"}],"wp:attachment":[{"href":"https:\/\/dryice.co.za\/wp-json\/wp\/v2\/media?parent=5145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}